# MismatchNoAvailableConnector Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ConnectorFailures..::..MismatchNoAvailableConnector Property
BuiltInFailures..::..ConnectorFailures Class See Also
---
Cannot add [Element] to System. There is no available connector matching the System Type ([Type Name]) for the System.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MismatchNoAvailableConnector { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MismatchNoAvailableConnector As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MismatchNoAvailableConnector {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ConnectorFailures Class
Autodesk.Revit.DB Namespace